#### Terraform Plan 📖 ####
<details><summary>Show Plan</summary>

```terraform
tailscale_tailnet_key.main: Refreshing state... [id=kANHoGieHD11CNTRL]
data.cloudflare_ip_ranges.main: Reading...
data.cloudflare_account.main: Reading...
data.cloudflare_ip_ranges.main: Read complete after 0s
data.oci_identity_availability_domains.main: Reading...
data.oci_core_services.all_services: Reading...
oci_identity_user.manager: Refreshing state... [id=ocid1.user.oc1..aaaaaaaafxpfydig3om5bsydxijntrc64fbbjalgrjybqq6i2eihpjkxpzta]
oci_identity_compartment.main: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq]
oci_budget_budget.main: Refreshing state... [id=ocid1.budget.oc1.ap-seoul-1.amaaaaaabsyhd7qa2wpumdq7peealllchr7ao5lcpkldzdgzgq7qoij4x2yq]
oci_identity_group.managers: Refreshing state... [id=ocid1.group.oc1..aaaaaaaac7alsg5sta36d66mr4yflfdakygdxxusvnv54km3nznudlyvbaba]
data.oci_containerengine_cluster_option.main: Reading...
oci_objectstorage_bucket.state: Refreshing state... [id=n/cnm7patunz1z/b/platform-state]
oci_logging_log_group.main: Refreshing state... [id=ocid1.loggroup.oc1.ap-seoul-1.amaaaaaabsyhd7qaqvtgvi64v26joo3vxbfpml4csr72nwk5cirrxqpjotda]
oci_core_vcn.main: Refreshing state... [id=ocid1.vcn.oc1.ap-seoul-1.amaaaaaabsyhd7qazvdwifpfgn75iw5yxheajr5ng4esmlikj23v7ee2ef3q]
data.oci_identity_availability_domains.main: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-686890930]
data.oci_core_images.ubuntu: Reading...
data.oci_containerengine_cluster_option.main: Read complete after 1s [id=ContainerengineClusterOptionDataSource-1870923232]
oci_identity_policy.cluster: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaagu6nbrnawfhjdwnrkfbzn6smo345m22gzfl55qxvxt7vep4yfqeq]
oci_ons_notification_topic.main: Refreshing state... [id=ocid1.onstopic.oc1.ap-seoul-1.amaaaaaabsyhd7qaitbrw7kzaoyqmbd5ld4hrjt6wss4fexrwgz4qngcknga]
oci_artifacts_container_repository.application: Refreshing state... [id=ocid1.containerrepo.oc1.ap-seoul-1.0.cnm7patunz1z.aaaaaaaa7rlpcolbbhe2tqr3r4tokxl4wizslzh4pryinxffib4wdq3mzhma]
data.oci_core_services.all_services: Read complete after 1s [id=CoreServicesDataSource-0]
oci_core_public_ip.main: Refreshing state... [id=ocid1.publicip.oc1.ap-seoul-1.amaaaaaabsyhd7qafbingjhb7nxqn3qcaowsc7sgyi2trscfa6jzlhu7wvmq]
data.oci_identity_fault_domains.main: Reading...
oci_budget_alert_rule.main: Refreshing state... [id=ocid1.alertrule.oc1.ap-seoul-1.amaaaaaabsyhd7qajb44qwouyva4scc7ygfqdopoxjihlhbakqyetfr2wv2q]
oci_identity_auth_token.application: Refreshing state... [id=ocid1.credential.oc1..aaaaaaaad6ed2wnvwb7pqj6mipgcodcurwrqz35u2elduhntp72r7yemi6ea]
data.oci_identity_fault_domains.main: Read complete after 0s [id=IdentityFaultDomainsDataSource-2954258040]
oci_identity_policy.manager: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaayhc5xs4li2w3l32btbgwn5bh6om3lyn2y2qiyvcrsebvbno4e6cq]
oci_identity_user_group_membership.manager: Refreshing state... [id=ocid1.groupmembership.oc1..aaaaaaaa3mgwk4qef6qpqqgvi7duo7ep6ydxa6ionu4l5gx3vgffqaa3qutq]
oci_core_network_security_group.bastion: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaayquhop5uavha3rpzt4lukx6kdpz6d6wraegzddtzahq4pnlwhzgq]
oci_core_internet_gateway.main: Refreshing state... [id=ocid1.internetgateway.oc1.ap-seoul-1.aaaaaaaaonpjrtiqcayeevrkbiavrrjberaljszeqx3xxucgnczyyn34u4ka]
oci_core_nat_gateway.main: Refreshing state... [id=ocid1.natgateway.oc1.ap-seoul-1.aaaaaaaap7fljb33jz7xfhnm54leup5owryl6xen4fzgkvnjqdz3dtsoupkq]
oci_core_network_security_group.worker: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq]
data.oci_core_images.ubuntu: Read complete after 1s [id=CoreImagesDataSource-675692870]
oci_core_service_gateway.main: Refreshing state... [id=ocid1.servicegateway.oc1.ap-seoul-1.aaaaaaaa6pdgo7kccqt4r4cs747knrxybmaz2xkcvdaqau6ztjc2rdm3tnba]
oci_core_network_security_group.cluster: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaargvnkigajohw6qvznbzlrdtmivyeaunrlx5dgeqvugie7xywtnea]
oci_core_route_table.public: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaaf4htalzhwrxx4763yptthhd7oxu4schmuv2hq5u32xbi22pygdqq]
oci_ons_subscription.email: Refreshing state... [id=ocid1.onssubscription.oc1.ap-seoul-1.aaaaaaaaaarkzfrko5jnvzkbpad3c5fojdswzzu3u47ffxiisu4agl4rqwzq]
oci_monitoring_alarm.instance-memory: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qas5de7mmyekowv2zsbw2oxqz6pjwpqa5awsttqhtf4o2q]
oci_monitoring_alarm.instance-cpu: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qa6qx5fjp34nevhtdeneyqhjzt43stjxvzy6jip2gpcs6a]
oci_core_network_security_group_security_rule.bastion-to-global: Refreshing state... [id=5B12E3]
oci_core_network_security_group_security_rule.worker-from-bastion: Refreshing state... [id=DE31C8]
oci_core_network_security_group_security_rule.worker-from-https: Refreshing state... [id=A848B6]
oci_core_network_security_group_security_rule.worker-to-global: Refreshing state... [id=903BB0]
oci_core_network_security_group_security_rule.worker-from-http: Refreshing state... [id=C35C7C]
oci_core_network_security_group_security_rule.worker-from-worker: Refreshing state... [id=3CF182]
oci_core_network_security_group_security_rule.worker-icmp: Refreshing state... [id=9C1E3C]
oci_core_network_security_group_security_rule.cluster-to-global: Refreshing state... [id=C704C9]
oci_core_network_security_group_security_rule.worker-from-cluster: Refreshing state... [id=804EE8]
oci_core_network_security_group_security_rule.cluster-to-worker: Refreshing state... [id=8489A2]
oci_core_network_security_group_security_rule.cluster-from-bastion: Refreshing state... [id=E359DE]
oci_core_network_security_group_security_rule.cluster-from-worker-api: Refreshing state... [id=A3A3FB]
oci_core_network_security_group_security_rule.cluster-from-worker-management: Refreshing state... [id=407CCB]
oci_core_subnet.public: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq]
oci_logging_log.subnet-public: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qahitcriuodikgvfgjk7qcjpapxg32de6zai6mtuuearca]
oci_core_route_table.private: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaa2gdnpvg6ecx744a63vowlzaagbsqkmbb7wuf2i5lyyilfaesfpmq]
data.cloudflare_account.main: Read complete after 3s [id=ec0cbb953bed382efecdedb2fadea7c4]
cloudflare_zone.main: Refreshing state... [id=17ad56810b60da50d4fc69f477b6e3fd]
oci_core_subnet.private: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaaz2zzw7w2kolrxzxelyfpu2lnsa6oths6txnblyewgc7wf3pr6dqq]
cloudflare_zone_setting.security-level: Refreshing state... [id=security_level]
cloudflare_zone_setting.ssl-mode: Refreshing state... [id=ssl]
cloudflare_zone_setting.tls-version: Refreshing state... [id=min_tls_version]
cloudflare_zone_setting.secure-mode: Refreshing state... [id=always_use_https]
cloudflare_zone_setting.websocket: Refreshing state... [id=websockets]
cloudflare_dns_record.dashboard: Refreshing state... [id=b851bc0c9ae7943e8f33c1049634f142]
tailscale_acl.main: Refreshing state... [id=1b5d5621-19fb-f490-b890-5cba657914cf]
oci_logging_log.subnet-private: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qalejvdxip7gkcra4rcyqknkchnfumj4j766annytvv4ba]
oci_containerengine_cluster.main: Refreshing state... [id=ocid1.cluster.oc1.ap-seoul-1.aaaaaaaav675okbokp7hx5psdy6mt2bstn6zvvgvxvcuipmrvcxsuzj32fmq]
oci_core_instance.bastion: Refreshing state... [id=ocid1.instance.oc1.ap-seoul-1.anuwgljrbsyhd7qcrxmlulolu4tzvap7fgqnkmyhieqcmmbeo6eqktuawniq]
data.oci_containerengine_node_pool_option.main: Reading...
data.oci_containerengine_cluster_kube_config.main: Reading...
data.oci_containerengine_node_pool_option.main: Read complete after 0s [id=ContainerengineNodePoolOptionDataSource-3381421671]
oci_containerengine_node_pool.main: Refreshing state... [id=ocid1.nodepool.oc1.ap-seoul-1.aaaaaaaan674whrp5r7gjgbl3g3fvvpyfrnrg523vn3cs7vmtnz7pmrrmlia]
data.oci_containerengine_cluster_kube_config.main: Read complete after 0s [id=ContainerengineClusterKubeConfigDataSource-3656204518]
helm_release.metrics: Refreshing state... [id=metrics]
kubernetes_namespace_v1.dev: Refreshing state... [id=dev]
kubernetes_priority_class_v1.dev: Refreshing state... [id=priority-dev]
kubernetes_daemon_set_v1.bootstrap: Refreshing state... [id=kube-system/bootstrap]
kubernetes_priority_class_v1.main: Refreshing state... [id=priority-main]
kubernetes_priority_class_v1.system: Refreshing state... [id=priority-system]
kubernetes_storage_class_v1.dummy: Refreshing state... [id=dummy]
kubernetes_namespace_v1.main: Refreshing state... [id=main]
kubernetes_namespace_v1.system: Refreshing state... [id=system]
kubernetes_limit_range_v1.main: Refreshing state... [id=main/limit-main]
kubernetes_resource_quota_v1.main: Refreshing state... [id=main/quota-main]
kubernetes_resource_quota_v1.dev: Refreshing state... [id=dev/quota-dev]
kubernetes_limit_range_v1.dev: Refreshing state... [id=dev/limit-dev]
kubernetes_deployment_v1.application-dev: Refreshing state... [id=dev/application-dev]
kubernetes_resource_quota_v1.system: Refreshing state... [id=system/quota-system]
helm_release.controller: Refreshing state... [id=controller]
helm_release.dashboard: Refreshing state... [id=dashboard]
kubernetes_ingress_v1.dashboard: Refreshing state... [id=system/ingress-dashboard]
kubernetes_limit_range_v1.system: Refreshing state... [id=system/limit-system]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.controller will be updated in-place
  ~ resource "helm_release" "controller" {
      ~ id                         = "controller" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v3.6.5" -> (known after apply)
          ~ chart          = "traefik" -> (known after apply)
          ~ first_deployed = 1767538275 -> (known after apply)
          ~ last_deployed  = 1767542153 -> (known after apply)
          ~ name           = "controller" -> (known after apply)
          ~ namespace      = "system" -> (known after apply)
          ~ notes          = <<-EOT
                controller with docker.io/traefik:v3.6.5 has been deployed successfully on system namespace!
            EOT -> (known after apply)
          ~ revision       = 4 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - additionalArguments = [
                      - "--entryPoints.websecure.forwardedHeaders.trustedIPs=173.245.48.0/20,103.21.244.0/22,103.22.200.0/22,103.31.4.0/22,141.101.64.0/18,108.162.192.0/18,190.93.240.0/20,188.114.96.0/20,197.234.240.0/22,198.41.128.0/17,162.158.0.0/15,104.16.0.0/13,104.24.0.0/14,172.64.0.0/13,131.0.72.0/22",
                      - "--global.checknewversion=false",
                      - "--global.sendanonymoususage=false",
                      - "--log.level=DEBUG",
                      - "--serversTransport.insecureSkipVerify=true",
                    ]
                  - deployment          = {
                      - podAntiAffinity = {
                          - preferredDuringSchedulingIgnoredDuringExecution = [
                              - {
                                  - podAffinityTerm = {
                                      - labelSelector = {
                                          - matchExpressions = [
                                              - {
                                                  - key      = "app.kubernetes.io/name"
                                                  - operator = "In"
                                                  - values   = [
                                                      - "traefik",
                                                    ]
                                                },
                                            ]
                                        }
                                      - topologyKey   = "kubernetes.io/hostname"
                                    }
                                  - weight          = 100
                                },
                            ]
                        }
                      - replicas        = 2
                    }
                  - ports               = {
                      - web       = {
                          - redirections = {
                              - entryPoint = {
                                  - scheme = "https"
                                  - to     = "websecure"
                                }
                            }
                        }
                      - websecure = {
                          - tls = {
                              - enabled = true
                            }
                        }
                    }
                  - priorityClassName   = "priority-system"
                  - resources           = {
                      - limits   = {
                          - cpu    = "200m"
                          - memory = "256Mi"
                        }
                      - requests = {
                          - cpu    = "100m"
                          - memory = "128Mi"
                        }
                    }
                  - service             = {
                      - annotations = {
                          - "oci-network-load-balancer.oraclecloud.com/is-private"                  = "false"
                          - "oci-network-load-balancer.oraclecloud.com/oci-network-security-groups" = "ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq"
                          - "oci-network-load-balancer.oraclecloud.com/subnet"                      = "ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq"
                          - "oci.oraclecloud.com/load-balancer-type"                                = "nlb"
                          - "oci.oraclecloud.com/reserved-ips"                                      = "152.70.238.59"
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "38.0.1" -> (known after apply)
        } -> (known after apply)
        name                       = "controller"
      ~ values                     = [
          ~ jsonencode(
                {
                  - additionalArguments = [
                      - "--entryPoints.websecure.forwardedHeaders.trustedIPs=173.245.48.0/20,103.21.244.0/22,103.22.200.0/22,103.31.4.0/22,141.101.64.0/18,108.162.192.0/18,190.93.240.0/20,188.114.96.0/20,197.234.240.0/22,198.41.128.0/17,162.158.0.0/15,104.16.0.0/13,104.24.0.0/14,172.64.0.0/13,131.0.72.0/22",
                      - "--global.checknewversion=false",
                      - "--global.sendanonymoususage=false",
                      - "--log.level=DEBUG",
                      - "--serversTransport.insecureSkipVerify=true",
                    ]
                  - deployment          = {
                      - podAntiAffinity = {
                          - preferredDuringSchedulingIgnoredDuringExecution = [
                              - {
                                  - podAffinityTerm = {
                                      - labelSelector = {
                                          - matchExpressions = [
                                              - {
                                                  - key      = "app.kubernetes.io/name"
                                                  - operator = "In"
                                                  - values   = [
                                                      - "traefik",
                                                    ]
                                                },
                                            ]
                                        }
                                      - topologyKey   = "kubernetes.io/hostname"
                                    }
                                  - weight          = 100
                                },
                            ]
                        }
                      - replicas        = 2
                    }
                  - ports               = {
                      - web       = {
                          - redirections = {
                              - entryPoint = {
                                  - scheme = "https"
                                  - to     = "websecure"
                                }
                            }
                        }
                      - websecure = {
                          - tls = {
                              - enabled = true
                            }
                        }
                    }
                  - priorityClassName   = "priority-system"
                  - resources           = {
                      - limits   = {
                          - cpu    = "200m"
                          - memory = "256Mi"
                        }
                      - requests = {
                          - cpu    = "100m"
                          - memory = "128Mi"
                        }
                    }
                  - service             = {
                      - annotations = {
                          - "oci-network-load-balancer.oraclecloud.com/is-private"                  = "false"
                          - "oci-network-load-balancer.oraclecloud.com/oci-network-security-groups" = "ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq"
                          - "oci-network-load-balancer.oraclecloud.com/subnet"                      = "ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq"
                          - "oci.oraclecloud.com/load-balancer-type"                                = "nlb"
                          - "oci.oraclecloud.com/reserved-ips"                                      = "152.70.238.59"
                        }
                    }
                }
            ) -> (known after apply),
        ]
      ~ version                    = "38.0.1" -> "38.0.2"
        # (28 unchanged attributes hidden)
    }

  # kubernetes_daemon_set_v1.bootstrap will be destroyed
  # (because kubernetes_daemon_set_v1.bootstrap is not in configuration)
  - resource "kubernetes_daemon_set_v1" "bootstrap" {
      - id               = "kube-system/bootstrap" -> null
      - wait_for_rollout = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "bootstrap" -> null
          - namespace        = "kube-system" -> null
          - resource_version = "3699563" -> null
          - uid              = "f9db64c2-7ca3-44b2-849a-07b2315141d7" -> null
            # (1 unchanged attribute hidden)
        }

      - spec {
          - min_ready_seconds      = 0 -> null
          - revision_history_limit = 10 -> null

          - selector {
              - match_labels = {
                  - "app" = "bootstrap"
                } -> null
            }

          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "0" -> null
                  - max_unavailable = "1" -> null
                }
            }

          - template {
              - metadata {
                  - annotations      = {} -> null
                  - generation       = 0 -> null
                  - labels           = {
                      - "app" = "bootstrap"
                    } -> null
                    name             = null
                    # (4 unchanged attributes hidden)
                }
              - spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = true -> null
                  - dns_policy                       = "ClusterFirst" -> null
                  - enable_service_links             = true -> null
                  - host_ipc                         = false -> null
                  - host_network                     = true -> null
                  - host_pid                         = true -> null
                  - node_selector                    = {} -> null
                  - restart_policy                   = "Always" -> null
                  - scheduler_name                   = "default-scheduler" -> null
                  - share_process_namespace          = false -> null
                  - termination_grace_period_seconds = 30 -> null
                    # (6 unchanged attributes hidden)

                  - container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      - image                      = "registry.k8s.io/pause:3.9" -> null
                      - image_pull_policy          = "IfNotPresent" -> null
                      - name                       = "pause" -> null
                      - stdin                      = false -> null
                      - stdin_once                 = false -> null
                      - termination_message_path   = "/dev/termination-log" -> null
                      - termination_message_policy = "File" -> null
                      - tty                        = false -> null
                        # (2 unchanged attributes hidden)

                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }
                    }

                  - init_container {
                      - args                       = [] -> null
                      - command                    = [
                          - "nsenter",
                          - "-t",
                          - "1",
                          - "-m",
                          - "-u",
                          - "-i",
                          - "-n",
                          - "-p",
                          - "--",
                          - "sh",
                          - "-c",
                          - "CONN=$(nmcli -t -f NAME con show --active | head -n 1); nmcli con mod \"$CONN\" 802-3-ethernet.mtu 1500 && nmcli con up \"$CONN\"",
                        ] -> null
                      - image                      = "alpine:latest" -> null
                      - image_pull_policy          = "Always" -> null
                      - name                       = "bootstrap" -> null
                      - stdin                      = false -> null
                      - stdin_once                 = false -> null
                      - termination_message_path   = "/dev/termination-log" -> null
                      - termination_message_policy = "File" -> null
                      - tty                        = false -> null
                        # (2 unchanged attributes hidden)

                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }

                      - security_context {
                          - allow_privilege_escalation = true -> null
                          - privileged                 = true -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null
                            # (2 unchanged attributes hidden)
                        }
                    }
                }
            }
        }
    }

  # oci_core_subnet.public must be replaced
-/+ resource "oci_core_subnet" "public" {
      + availability_domain        = (known after apply)
      ~ defined_tags               = {} -> (known after apply)
      ~ dhcp_options_id            = "ocid1.dhcpoptions.oc1.ap-seoul-1.aaaaaaaarmormuxdsrwqoiodarzgryg5du5owxijv3zwd2he4uebknzxrfya" -> (known after apply)
      ~ dns_label                  = "publicmain" -> "public" # forces replacement
      ~ freeform_tags              = {} -> (known after apply)
      ~ id                         = "ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq" -> (known after apply)
      ~ ipv4cidr_blocks            = [
          - "10.0.1.0/24",
        ] -> (known after apply)
      + ipv6cidr_block             = (known after apply)
      ~ ipv6cidr_blocks            = [] -> (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      ~ prohibit_internet_ingress  = false -> (known after apply)
      ~ security_list_ids          = [
          - "ocid1.securitylist.oc1.ap-seoul-1.aaaaaaaadnkxrwd5a56zvzud3axzr2casm2d2tki4pgv7vqdlylfgdf6hena",
        ] -> (known after apply)
      ~ state                      = "AVAILABLE" -> (known after apply)
      ~ subnet_domain_name         = "publicmain.platform.oraclevcn.com" -> (known after apply)
      ~ time_created               = "2025-12-08 11:56:57.832 +0000 UTC" -> (known after apply)
      ~ virtual_router_ip          = "10.0.1.1" -> (known after apply)
      ~ virtual_router_mac         = "00:00:17:DA:9C:FC" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # oci_logging_log.subnet-public must be replaced
-/+ resource "oci_logging_log" "subnet-public" {
      ~ compartment_id     = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq" -> (known after apply)
      ~ defined_tags       = {} -> (known after apply)
      ~ freeform_tags      = {} -> (known after apply)
      ~ id                 = "ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qahitcriuodikgvfgjk7qcjpapxg32de6zai6mtuuearca" -> (known after apply)
      ~ is_enabled         = true -> (known after apply)
      ~ state              = "ACTIVE" -> (known after apply)
      ~ tenancy_id         = "ocid1.tenancy.oc1..aaaaaaaa5vwe52hngn55vyyitt2xeigrjqsibrlmewnsv2wjo3hnaw55i3aa" -> (known after apply)
      ~ time_created       = "2025-12-28 05:41:26.682 +0000 UTC" -> (known after apply)
      ~ time_last_modified = "2025-12-28 05:41:26.682 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ configuration {
          ~ compartment_id = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq" -> (known after apply)

          ~ source {
              ~ parameters  = {} -> (known after apply)
              ~ resource    = "ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq" -> (known after apply) # forces replacement
                # (3 unchanged attributes hidden)
            }
        }
    }

Plan: 2 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ensia96, Action: `pull_request`*